{
    "title": "Resume Michał Lechowicz",
    "personal-description": "Graduate in computer science",
    "about-point-1": "I am a graduate of the Faculty of <strong>Computer Science and Telecommunications</strong> at <strong>Cracow University of Technology.</strong>",
    "about-point-2": "I have been fascinated by computer science since an early age.",
    "about-point-3": "Additionally, I strive to stay updated with the latest trends by <strong>reading blogs, attending webinars, and listening to programming podcasts.</strong>",
    "about-point-4": "I have been creating in <strong> Java / Spring Boot and Angular.</strong>",
    "about-point-5": "During my internship, I assisted in preparing migration instructions for a new environment. I also worked on improving <strong>CI/CD</strong> and a script used for creating <strong>Docker images</strong>.",
    "about-point-6": "I implemented CI/CD using <strong>GitHub Actions</strong> and versioning for databases in my projects.",
    "about-point-7": "I would like to apply my skills in real-world applications.",
    "ftm-description": "Web application to track income and spendings for user's financial analysis. This application has been used for my thesis.",
    "ftm-technologies": "Technologies: Java 17, Spring Boot 3, Spring Security – Web Token, Liquibase, TestContainers, Hibernate, PostgreSQL, Angular 16, HTML, CSS, JS, Docker, JUnit, CI/CD - GitHub Action, REST",
    "ftm-team": "2-person team (now individual).",
    "q&a-description": "Web application for prepare to interview.",
    "q&a-technologies": "Technologies: Java 17, Spring Boot 3.1, Gradle, Spring Security – Web Token, Spring HATEOAS, MongoDB, Angular 17, REST, Git, CI/CD - GitHub Action",
    "q&a-team": "Individual project.",
    "cinammon-team": "8-persons team",
    "clipsum-team": "3-persons team",
    "shoptherapy-team": "Individual project.",
    "queststore-team": "4-persons team",
    "mastermind-team": "Individual project.",
    "pk-course-name": "Information Technology, Bachelor of Engineering",
    "pk-time": "October 2018 – June 2019, October 2020 – September 2023",
    "codecool-ft-curriculum": "CURRICULUM: Java, SQL, design pattern (ex. MVC, DAO, Builder), JavaScript, CSS, HTML, Java EE, Spring, Spring Boot",
    "codecool-basic-curriculum": "CURRICULUM: Basics of Python, Clean code, Git, unit tests, SCRUM",
    "pk-thesis": "Thesis",
    "pk-supervisor": "Supervisor's opinion",
    "pk-reviewer": "Reviewer's opinion",
    "technical-skills": "Technical stack",
    "hobby-content": "I like playing board games, chess, and adventure video games. Apart from that, I read blogs about new technologies. In addition, I am a hobbyist of political science, history and psychology. In my free time, I build DIY projects based on Arduino."
}
