{
    "title": "Resume Michał Lechowicz",
    "personal-description": "Graduate in computer science",
    "about-point-1": "I am a graduate of the Faculty of <strong>Computer Science and Telecommunications</strong> at <strong>Cracow University of Technology.</strong>",
    "about-point-2": "I have been fascinated by computer science since an early age.",
    "about-point-3": "Additionally, I strive to stay updated with the latest trends by <strong>reading blogs, attending webinars, and listening to programming podcasts.</strong>",
    "about-point-4": "I have been creating in <strong> Java / Spring Boot and Angular.</strong>",
    "about-point-5": "During my internship, I assisted in preparing migration instructions for a new environment. I also worked on improving <strong>CI/CD</strong> and a script used for creating <strong>Docker images</strong>.",
    "about-point-6": "I implemented CI/CD using <strong>GitHub Actions</strong> and versioning for databases in my projects.",
    "about-point-7": "I would like to apply my skills in real-world applications.",
    "links": "Links: ",
    "ftm-description": "Web application to track income and spendings for user's financial analysis. This application has been used for my thesis.",
    "ftm-technologies": "Technologies: Java 17, Spring Boot 3, Spring Security – Web Token, Liquibase, TestContainers, Hibernate, PostgreSQL, Angular 16, HTML, CSS, JS, Docker, JUnit, CI/CD - GitHub Action, REST",
    "ftm-team": "2-person team (now individual).",
    "cinammon-team": "8-person team",
    "clipsum-team": "3-person team",
    "shoptherapy-team": "Individual project.",
    "queststore-team": "4-person team",
    "mastermind-team": "Individual project.",
    "pk-course-name": "Information Technology, Bachelor of Engineering",
    "pk-time": "October 2018 – June 2019, October 2020 – September 2023",
    "codecool-ft-curriculum": "CURRICULUM: Java, SQL, design pattern (ex. MVC, DAO, Builder), JavaScript, CSS, HTML, Java EE, Spring, Spring Boot",
    "codecool-basic-curriculum": "CURRICULUM: Basics of Python, Clean code, Git, unit tests, SCRUM",
    "pk-thesis": "Thesis",
    "pk-supervisor": "Supervisor's opinion",
    "pk-reviewer": "Reviewer's opinion",
    "hobby-content": "I like playing board games, chess, and adventure video games. In addition, I am an enthusiast of political science, history and psychology. In my free time, I build DIY projects based on Arduino and read blogs about new technologies",
    "gdpr": "I agree to the processing of personal data provided in this document for realising the recruitment process pursuant to the Personal Data Protection Act of 10 May 2018 (Journal of Laws 2018, item 1000) and in agreement with Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation)."
}
