{
    "title": "CV Michał Lechowicz",
    "personal-description": "Absolwent Informatyki",
    "telephone": "Telefon:",
    "about-me": "O mnie" ,
    "technical-stack": "Stack Technologiczny:",
    "technical-main": "",
    "technical-secondary": "",
    "language": "Umiejętności językowe:",
    "language-polish": "polski - ojczysty",
    "language-english": "angielski - B2",
    "hobby": "Zainteresowania:",
    "hobby-content": "Lubię grać w gry planszowe, szachy i przygodowe gry komputerowe. Chętnie spędzam czas przy bilardzie z przyjaciółmi. Oprócz tego czytam blogi o nowoczesnych technologiach. Dodatkowo hobbystycznie interesuję się politologią, historią i psychologią. W wolnym czasie buduję praktyczne projekty DIY w oparciu o Arduino.",
    "about-content": "Jestem absolwenetem Informatyki Wydziału Informatyki i Telekomunikacji Politechniki Krakowskiej. Programowanie fascynuje mnie od dawna. Od kilku lat uczę się technologii webowych. Piszę w języku Java, frameworku Spring Boot oraz Angular. Uczyłem się programować zarówno samodzielnie, jak i na uczelni oraz w szkole programowania. Chciałbym wykorzystać swoje umiejętności w rzeczywistych zastosowaniach.",
    "experience" : "Doświadczenie",
    "euvic-position": "Praktyki",
    "euvic-time": "5 września 2022 do 5 paźdzernika 2022",
    "euvic-location": "Zdalnie",
    "experience-description": "Opis stanowiska:",
    "euvic-1": "Przygotowanie instrukcji migracji do monorepozytorium:",
    "euvic-1-description": "Podczas moich praktyk, trzy oddzielne repozytoria były migrowane do jednego wspólnego repozytorium (dla części back-endowej). Ja i inny developer mieliśmy za zadanie przygotować instrukcję migracji dla innych zespołów developerskich.",
    "euvic-2" : "Konfiguracja nowego środowiska backendowego dla Dockera:",
    "euvic-2-description": "Usprawniłem skrypt do tworzenia obrazu Dockera i uruchamiania środowiska. Dodatkowo sprawnie zidentyfikowałem niedziałające testy i je wyłączyłem. Następnie naprawiłem skrypt służący do postawienia Dockera.",
    "euvic-3": "Poprawa wydajności procesu CI/CD na Bitbucket:",
    "euvic-3-description": "Współpracowaliśmy z programistami i architektami z naszego zespołu, aby poprawić wydajność procesu CI/CD poprzez modyfikację poleceń Mavena. Wyłączyliśmy niepotrzebne testy, zredukowaliśmy powtarzanie tych samych kroków i usunęliśmy zbędne polecenia.",
    "euvic-4": "Testowanie ręczne nowych funkcji i zgłaszanie błędów:",
    "euvic-4-description": "Tester z mojego zespołu przeprowadził szkolenie na temat układu aplikacji, sposobu zgłaszania błędów oraz informowania o zakończonych przypadkach testowych. Po szkoleniu otrzymałem do wykonania kilka testów manualnych.",
    "euvic-5": "Praca nad złożonym, wielomodułowym projektem napisanym w&nbsp;technologii Java/Spring;",
    "euvic-6": "Praca z testami jednostkowymi w technologii JUnit5, DBUnit oraz DB Rider;",
    "euvic-7": "Praca w SCRUM;",
    "euvic-8": "Wykorzystanie narzędzia Jira do współpracy zespołowej.",
    "projects": "Projekty",
    "ftm-description": "Aplikacja internetowa do śledzenia dochodów i wydatków służąca do analizy finansowej użytkownika. Projekt 2-osobowy (obecnie indywidualny). Projekt został wykorzystany w mojej pracy inżynierskiej.",
    "ftm-technologies": "Technologie: Java 17, Spring Boot 3, Spring Security – Web Token, Liquibase, TestContainers, Hibernate, PostgreSQL, Angular 16, HTML, CSS, JS, Docker, JUnit, CI/CD",
    "q&a-description": "Aplikacja internetowa do nauki pytań rekrutacyjnych. Projekt indywidualny.",
    "q&a-technologies": "Technologie: Java 17, Spring Boot 3.1, Spring Security – Web Token, Spring HATEOAS, MongoDB,   Angular 17",
    "cinammon-description": "Aplikacja webowa do agregowania filmów nadawanych w kinach. Projekt 8-osobowy.",
    "clipsum-description": "Aplikacja webowa do streszczania artykułów z największych serwisów informacyjnych. Projekt 3-osobowy.",
    "shoptherapy-description": "Aplikacja internetowa do tworzenia list zakupów. Projekt indywidualny.",
    "queststore-description": "Aplikacja internetowa dla studentów do zdobywania wirtualnych monet i wymiany ich na nagrody. Projekt 4-osobowy.",
    "mastermind-description": "Implementacja klasycznej gry Mastermind z GUI. Projekt indywidualny.",
    "education": "Wykształcenie",
    "pk-course-name": "Studia inżynierskie na kierunku informatyka",
    "pk-name": "Politechnika Krakowska",
    "pk-time": "październik 2018 – czerwiec 2019, październik 2020 – wrzesień 2023",
    "pk-thesis": "Praca inżynierska",
    "pk-supervisor": "Opinia promotora",
    "pk-reviewer": "Opinia recenzenta",
    "codecool-name": "Szkoła programowania Codecool",
    "codecool-ft-time": "styczeń 2020 - październik 2020",
    "codecool-basic-time": "czerwiec 2019 - październik 2019",
    "codecool-ft-curriculum": "CURRICULUM: Java, SQL, wzorce projektowe (m.in. MVC, DAO, Builder), JavaScript, CSS, HTML, Java EE, Spring, Spring Boot",
    "codecool-basic-curriculum": "CURRICULUM: Podstawy Pythona, Clean code, Git, testy jednostowe, SCRUM",
    "gdpr": "Wyrażam zgodę na przetwarzanie moich danych osobowych dla potrzeb niezbędnych do realizacji procesu rekrutacji (zgodnie z ustawą z dnia 10 maja 2018 roku o ochronie danych osobowych (Dz. Ustaw z 2018, poz. 1000) oraz zgodnie z Rozporządzeniem Parlamentu Europejskiego i Rady (UE) 2016/679 z dnia 27 kwietnia 2016 r. w sprawie ochrony osób fizycznych w związku z przetwarzaniem danych osobowych i w sprawie swobodnego przepływu takich danych oraz uchylenia dyrektywy 95/46/WE (RODO)."
}
