{
    "title": "CV Michał Lechowicz",
    "personal-description": "Absolwent Informatyki",
    "telephone": "Telefon:",
    "link-description": "Link do profilu",
    "about-me": "O mnie" ,
    "language": "Umiejętności językowe",
    "language-polish": "Polski<span>: ojczysty</span>",
    "language-english": "Angielski<span>: B2</span>",
    "hobby": "Zainteresowania",
    "hobby-content": "Lubię grać w gry komputerowe i planszowe oraz szachy. Chętnie spędzam czas przy bilardzie z przyjaciółmi. Oprócz tego czytam blogi o nowoczesnych technologiach. Dodatkowo hobbystycznie interesuję się politologią, historią i psychologią. W wolnym czasie buduję praktyczne projekty DIY w oparciu o Arduino.",
    "about-point-1": "Jestem absolwentem Informatyki Wydziału Informatyki i Telekomunikacji <strong>Politechniki Krakowskiej.</strong>",
    "about-point-2": "Programowanie fascynuje mnie od dawna.",
    "about-point-3": "Piszę w języku <strong>Java, frameworku Spring Boot oraz Angular.</strong>",
    "about-point-4": "Ponadto staram się być na bieżąco z najnowszymi trendami; czytam <strong>blogi, uczestniczę w webinariach oraz słucham podcastów programistycznych.</strong>",
    "about-point-5": "W trakcie praktyk pomagałem w przygotowaniu instrukcji migracji do nowego środowiska. Zajmowałem się też poprawą <strong>CI/CD</strong> i skryptu służącego do tworzenia obrazu <strong>Docker</strong>.",
    "about-point-6": "Wdrożyłem CI/CD na <strong>GitHub Action</strong> oraz wersjonowanie bazy danych do moich projektów.",
    "about-point-7": "Chciałbym wykorzystać swoje umiejętności w rzeczywistych zastosowaniach.",
    "experience" : "Doświadczenie",
    "euvic-position": "Praktyki",
    "euvic-time": "5 września 2022 do 5 paźdzernika 2022",
    "euvic-location": "Zdalnie",
    "experience-description": "Opis stanowiska:",
    "euvic-1": "Przygotowanie <strong>instrukcji migracji do monorepozytorium:</strong>",
    "euvic-1-description-1": "Podczas moich praktyk, trzy oddzielne repozytoria były migrowane do jednego wspólnego repozytorium.",
    "euvic-1-description-2": "Wraz z drugim programistą mieliśmy za zadanie przygotować instrukcję migracji dla innych zespołów developerskich. Gotowa instrukcja została dodana do dokumentacji aplikacji.",
    "euvic-2" : "Konfiguracja nowego <strong>środowiska backendowego dla Dockera:</strong>",
    "euvic-2-description-1": "Usprawniłem skrypt do tworzenia obrazu Dockera i uruchamiania środowiska.",
    "euvic-2-description-2": "Dodatkowo sprawnie zidentyfikowałem niedziałające testy i je wyłączyłem.",
    "euvic-2-description-3": "Naprawiłem skrypt służący do postawienia Dockera.",
    "euvic-3": "Poprawa wydajności <strong>procesu CI/CD na Bitbucket</strong>:",
    "euvic-3-description-1": "Współpracowaliśmy z programistami i architektami z naszego zespołu, aby poprawić wydajność procesu CI/CD poprzez modyfikację poleceń Mavena.",
    "euvic-3-description-2": "Wyłączyliśmy niepotrzebne testy, zredukowaliśmy powtarzanie tych samych kroków i usunęliśmy zbędne polecenia.",
    "euvic-4": "<strong>Testowanie ręczne</strong> nowych funkcji i zgłaszanie błędów:",
    "euvic-4-description-1": "Tester z mojego zespołu przeprowadził szkolenie na temat układu aplikacji, sposobu zgłaszania błędów oraz informowania o zakończonych przypadkach testowych.",
    "euvic-4-description-2": "Po zakończeniu szkolenia otrzymałem do wykonania kilka testów manualnych.",
    "euvic-5": "Praca nad złożonym, <strong>wielomodułowym projektem</strong> napisanym w&nbsp;technologii Java/Spring;",
    "euvic-6": "Praca z testami jednostkowymi w technologii <strong>JUnit5, DBUnit oraz DB Rider</strong>;",
    "euvic-7": "Praca w <strong>SCRUM</strong>;",
    "euvic-8": "Wykorzystanie narzędzia <strong>Jira</strong> do współpracy zespołowej.",
    "projects": "Projekty",
    "links": "Linki: ",
    "ftm-server-repo": "Repozytorium serwera",
    "ftm-client-repo": "Repozytorium klienta",
    "ftm-description": "Aplikacja internetowa do śledzenia dochodów i wydatków służąca do analizy finansowej użytkownika. Projekt został wykorzystany w mojej pracy inżynierskiej.",
    "ftm-technologies": "Technologie: Java 17, Spring Boot 3, Spring Security – Web Token, Liquibase, TestContainers, Hibernate, PostgreSQL, Angular 16, Git, HTML, CSS, JS, Docker, JUnit, CI/CD - GitHub Action, REST",
    "ftm-team": "Zespół 2-osobowy (obecnie indywidualny).",
    "repo": "Repozytorium",
    "cinammon-description": "Aplikacja webowa do agregowania filmów nadawanych w kinach.",
    "cinammon-team": "Zespół 8-osobowy",
    "clipsum-description": "Aplikacja webowa do streszczania artykułów z największych serwisów informacyjnych.",
    "clipsum-team": "Zespół 3-osobowy",
    "shoptherapy-description": "Aplikacja internetowa do tworzenia list zakupów.",
    "shoptherapy-team": "Projekt indywidualny",
    "queststore-description": "Aplikacja internetowa dla studentów do zdobywania wirtualnych monet i wymiany ich na nagrody.",
    "queststore-team": "Zespół 4-osobowy",
    "mastermind-description": "Implementacja klasycznej gry Mastermind z GUI.",
    "mastermind-team": "Projekt indywidualny",
    "education": "Wykształcenie",
    "pk-course-name": "Studia inżynierskie na kierunku informatyka",
    "pk-name": "Politechnika Krakowska",
    "pk-time": "październik 2018 – czerwiec 2019, październik 2020 – wrzesień 2023",
    "pk-thesis": "Praca inżynierska",
    "pk-supervisor": "Opinia promotora",
    "pk-reviewer": "Opinia recenzenta",
    "codecool-name": "Szkoła programowania Codecool",
    "codecool-ft-time": "styczeń 2020 - październik 2020",
    "codecool-basic-time": "czerwiec 2019 - październik 2019",
    "codecool-ft-curriculum": "CURRICULUM: Java, SQL, wzorce projektowe (m.in. MVC, DAO, Builder), JavaScript, CSS, HTML, Java EE, Spring, Spring Boot",
    "codecool-basic-curriculum": "CURRICULUM: Podstawy Pythona, Clean code, Git, testy jednostowe, SCRUM",
    "gdpr": "Wyrażam zgodę na przetwarzanie moich danych osobowych dla potrzeb niezbędnych do realizacji procesu rekrutacji (zgodnie z ustawą z dnia 10 maja 2018 roku o ochronie danych osobowych (Dz. Ustaw z 2018, poz. 1000) oraz zgodnie z Rozporządzeniem Parlamentu Europejskiego i Rady (UE) 2016/679 z dnia 27 kwietnia 2016 r. w sprawie ochrony osób fizycznych w związku z przetwarzaniem danych osobowych i w sprawie swobodnego przepływu takich danych oraz uchylenia dyrektywy 95/46/WE (RODO)."
}
